snlkuharlocal/src/DataProcessors/ФР_ОбменДанными/ФР_ОбменДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФР_ОбменДанными</name>
  <attributes>
    <name>Дата1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Сеанса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаОбмена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаданияОбмена</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Направление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Начало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Конец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнформацияОбОшибке</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/DataProcessors/ФР_ОбменДанными/Forms/ФормаТонкая/Module.bsl
#Область СобытияФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ОбновитьтаблицуЗаданий_НаСервере();
	
	АдресаРезультатов	= Новый СписокЗначений;
	Терминал1_ХТМЛ		= ПолучитьТестМакета("ХТМЛ_ОкноТерминала");
КонецПроцедуры

&НаСервере
Процедура ОбновитьтаблицуЗаданий_НаСервере()
	ОтборФЗ		= Новый Структура("Состояние,ИмяМетода",СостояниеФоновогоЗадания.Активно,"ФР_Регламент.Обмен_в_Фоне");
	СписокФЗ	= ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборФЗ);
	
	Объект.ЗаданияОбмена.Очистить();
	
	Для Каждого ФЗ Из СписокФЗ Цикл		
		СтрокаФЗ	= Объект.ЗаданияОбмена.Добавить();		
		ЗаполнитьЗначенияСвойств(СтрокаФЗ,ФЗ);		
	КонецЦикла; 
	
	МЗ	= ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Состояние,ИмяМетода,Начало",СостояниеФоновогоЗадания.ЗавершеноАварийно,"Регламент.Обмен_в_Фоне",ТекущаяДата()-24*60*60));
	Для Каждого Задание Из МЗ Цикл
		СтрокаФЗ	= Объект.ЗаданияОбмена.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаФЗ,Задание,,"ИнформацияОбОшибке");	
		
		СтрокаФЗ.ИнформацияОбОшибке	=  
			Задание.ИнформацияОбОшибке.ИмяМодуля+"
			| "+Задание.ИнформацияОбОшибке.ИсходнаяСтрока+ "(Стр. "+Задание.ИнформацияОбОшибке.НомерСтроки+")
			| "+Задание.ИнформацияОбОшибке.Описание;
	КонецЦикла;
КонецПроцедуры //ЗаполнитьСтатусыЗаданий()

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
КонецПроцедуры


#КонецОбласти 

&НаКлиенте
Процедура ЗапутитьОбменВФоне(Команда)
	ПараметрыКоманды	= ФР_ОбщегоНазначения_КС.СтрокуВСтруктуру(Команда.Имя,"Ч,Направление","_");
	
	ФР_Регламент.ЗапуститьФЗ_Обмена("ФР_ОбменСФРК",ПараметрыКоманды.Направление);
	
	ОбновитьтаблицуЗаданий_НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьЗадания(Кнопка)	
	Если Элементы.ЗаданияОбмена.ВыделенныеСтроки.Количество()>0 Тогда
		Для Каждого ИД_Строки Из Элементы.ЗаданияОбмена.ВыделенныеСтроки Цикл
			СтрокаТЗ	= Объект.ЗаданияОбмена.НайтиПоИдентификатору(ИД_Строки);
			Результат	= ОстановитьФЗ_НаСервере(СтрокаТЗ.УникальныйИдентификатор);
		
			Если НЕ ПустаяСтрока(Результат) Тогда		
				ВывестиВТерминалНаКлиенте(СтрШаблон("Остановлено ФЗ: '%1'.",Результат),"DarkOrange","p");
			КонецЕсли;		
		КонецЦикла;
	
		ПодключитьОбработчикОжидания("ОбновитьТаблицуЗаданий",3,1);	
	Иначе
		ВывестиВТерминалНаКлиенте("Не выбрано ни одного задания для остановки.","red","H1");	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ОстановитьФЗ_НаСервере(ФЗ_УИД)
	Результат  = "";
	ФЗ	= ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ФЗ_УИД);
	Если ФЗ<>Неопределено И ФЗ.Состояние=СостояниеФоновогоЗадания.Активно Тогда
		ФЗ.Отменить();	
		
		Результат=СтрШаблон("%1 (%2)",ФЗ.Наименование,ФЗ.УникальныйИдентификатор);
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции
 

&НаСервере
Функция ПолучитьТестМакета(ИмяМакета)
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяМакета).ПолучитьТекст();
КонецФункции // ()

&НаКлиенте
Функция ВывестиВТерминалНаКлиенте(Текст,Знач Цвет="black",Тэг="div")	
	Элементы.Терминал1_ХТМЛ.Документ.defaultView.write_mes(СтрШаблон("<%3 style='color: %2'>%1</%3>",Текст,Цвет,Тэг));	
КонецФункции //ВывестиВТерминал(Текст)

&НаСервере
Функция СоздатьСообщение(ТекстСообщения,Цвет,Ошибка)
	Возврат Новый Структура("ТекстСообщения,Цвет,Ошибка",ТекстСообщения,Цвет,Ошибка);	
КонецФункции // ()

&НаКлиенте
Процедура кнВыполнитьОбмен(Команда)
	ФД.Очистить();	
	Объект.ИД_Сеанса = Новый УникальныйИдентификатор;
	
	ВыполнитьОбменЧерезДлительнуюОперацию("ОбменСЕЕ","Прием,Отправка");
КонецПроцедуры

&НаСервере
Функция ПолучитьСостояниеФЗ()
	Результат = Новый Структура("Состояние","");	
	
	СписокФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("УникальныйИдентификатор",Новый УникальныйИдентификатор(ИД_ФЗ)));
	Для Каждого ФЗ Из СписокФЗ Цикл
		Результат = Новый Структура("Состояние",""+ФЗ.Состояние);	
		
		Результат.Вставить("Сообщения",ФЗ.ПолучитьСообщенияПользователю(Истина));
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции // ()

&НаКлиенте
Функция ОО_СостояниеФЗ() Экспорт	
	Результат = ПолучитьСостояниеФЗ();
	Если Результат.Состояние="Задание выполняется" Тогда
		//Сообщить(Результат.Состояние);			
		
		Для Каждого Сообщение Из Результат.Сообщения Цикл
			ВывестиВТерминалНаКлиенте(Сообщение.Текст);		
		КонецЦикла; 
		
		ПодключитьОбработчикОжидания("ОО_СостояниеФЗ",1.1,Истина);
	КонецЕсли; 
	
КонецФункции // ()
 
&НаКлиенте
Процедура ВыполнитьОбменЧерезДлительнуюОперацию(ИмяПланаОбмена,Знач Направления)
	ПодключитьОбработчикОжидания("ЧтениеСообщений",1);
	
	Поз=СтрНайти(Направления,",");	
	Если Поз>0 Тогда
		Направление		= Лев(Направления,Поз-1);
		ДопНаправления	= Сред(Направления,Поз+1);
	Иначе
		Направление		= Направления;
		ДопНаправления	= "";		
	КонецЕсли;	
	
	ДлительнаяОперация = ВыполнитьОбмен_с_ЦБ_ФР_НаСервере(Направление);	
	
	Если ДлительнаяОперация<>Неопределено Тогда		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);    
		
		ПараметрыОжидания.ВыводитьПрогрессВыполнения	= Ложь;
		ПараметрыОжидания.ВыводитьОкноОжидания			= Ложь;
		// указываем интервал обновления состояния в секундах, если не указать, 
		// то интервал будет увеличиваться при каждой итерации в 1.4 раза.
		ПараметрыОжидания.Интервал = 1.1;
		
		ДопПараметрыОО	= Новый Структура("ИмяПланаОбмена,Направление,ДопНаправления",ИмяПланаОбмена,Направление,ДопНаправления);
		ОО				= Новый ОписаниеОповещения("ОбменВФоне_Выполнено", ЭтотОбъект,ДопПараметрыОО);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,ОО,ПараметрыОжидания);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВыполнитьОбмен_с_ЦБ_ФР_НаСервере(Направление)	
	АдресРезультата	= ПоместитьВоВременноеХранилище(Неопределено,ЭтаФорма.УникальныйИдентификатор);	
	ИД_ФЗ			= ФР_Регламент.Выполнить_Обмен(ПланыОбмена.ФР_ОбменСФРК,Направление,1,ПолучитьПараметрыОбмена(АдресРезультата));	
	
	Возврат ДлительнаяОперация(ИД_ФЗ,АдресРезультата);
КонецФункции

&НаСервере
Функция ПолучитьПараметрыОбмена(АдресРезультата)
	Возврат Новый Структура("АдресРезультата,ИД_Сеанса,ВыводитьСообщения",АдресРезультата,Объект.ИД_Сеанса,Истина);
КонецФункции // ()

&НаСервере
Функция ДлительнаяОперация(ИД_ФЗ,АдресРезультата)
	ДанныеДО	= Новый Структура("
	|АдресДополнительногоРезультата,
	|АдресРезультата,
	|ИдентификаторЗадания,
	|КраткоеПредставлениеОшибки,
	|ПодробноеПредставлениеОшибки,
	|Сообщения,
	|Статус");
	
	ДанныеДО.АдресРезультата		= АдресРезультата;
	ДанныеДО.ИдентификаторЗадания   = Новый УникальныйИдентификатор(ИД_ФЗ);
	ДанныеДО.Статус					= ДлительныеОперации.ОперацияВыполнена(ИД_ФЗ).Статус;
	
	Возврат ДанныеДО;
КонецФункции // ()

&НаКлиенте
Процедура ЧтениеСообщений()	
	Если НЕ ПустаяСтрока(ИД_ФЗ) Тогда	
		Результат = ЧтениеСообщенийНаСервере();
		Для Каждого Сообщение Из Результат.Сообщения Цикл
			ВывестиВТерминалНаКлиенте(Сообщение.Текст);		
		КонецЦикла;
		
		Если Результат.ЗаданиеЗавершено  Тогда
			АдресРезультата	= АдресаРезультатов.НайтиПоЗначению(ИД_ФЗ);
			Если АдресРезультата<>Неопределено Тогда
				Результат	= ПолучитьИзВременногоХранилища(АдресРезультата);
				Если Результат<>Неопределено Тогда			
					Для Каждого ЭлементПакета Из Результат.Статистика Цикл
						Сообщить(ЭлементПакета);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли; 
			ОтключитьОбработчикОжидания("ЧтениеСообщений");
		КонецЕсли;	
	Иначе
		ОтключитьОбработчикОжидания("ЧтениеСообщений");		
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ЧтениеСообщенийНаСервере()	
	Результат	= Новый Структура("ЗаданиеЗавершено,Сообщения",Истина,Новый Массив);	
	Попытка
		ФЗ	= ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ИД_ФЗ));
	Исключение
		ФЗ	= Неопределено;	
	КонецПопытки;	
	
	Если ФЗ<>Неопределено Тогда		
		Результат.Сообщения	= ФЗ.ПолучитьСообщенияПользователю(Истина);			
		
		Если ФЗ.Состояние=СостояниеФоновогоЗадания.Активно Тогда
			Результат.ЗаданиеЗавершено = Ложь;		
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ОбменВФоне_Выполнено(Результат,ДопПараметры) Экспорт	
	Если Результат=Неопределено Тогда Возврат КонецЕсли;
	
	Если НЕ Результат.Статус="Выполнено" Тогда
		ВывестиВТерминалНаКлиенте(Результат.КраткоеПредставлениеОшибки);	
	КонецЕсли;	
	
	ДопНаправления	= ФР_ОбщегоНазначения.ПолучитьЗначениеПараметра(ДопПараметры,"ДопНаправления","");
	Если НЕ ПустаяСтрока(ДопНаправления) Тогда		
		ВыполнитьОбменЧерезДлительнуюОперацию(ДопПараметры.ИмяПланаОбмена,ДопНаправления);	
	КонецЕсли;
	
	Если Результат.Статус="Выполнено" Тогда
		Данные	= ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если Данные<>Неопределено Тогда
			//Сообщить("ИД_Сеанса_: "+Данные.ИД_Сеанса);		
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура кнОбновитьТаблицуЗаданий(Команда)
	ОбновитьтаблицуЗаданий_НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуЗаданий()
	ОбновитьтаблицуЗаданий_НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	ДД = Новый ДвоичныеДанные(Объект.ИмяФайлаОбмена);
	
	Результат = ЗагрузитьДанныеНаСервере(ПолучитьСтрокуИзДвоичныхДанных(ДД));		
КонецПроцедуры

&НаСервере
Функция ЗагрузитьДанныеНаСервере(СтрокаДанных)
	ОбработкаОбмена = Обработки.ВыгрузкаВоФранчБазу.Создать();			
	ОбработкаОбмена.ИмяФайлаОбмена = Объект.ИмяФайлаОбмена;
	
	ПротоколЗагрузки = ОбработкаОбмена.ЗагрузитьФайлХДТО(СтрокаДанных);
	ВывестиПротоколЗагрузки(ОбработкаОбмена,ПротоколЗагрузки);
	
	Возврат ПротоколЗагрузки;
КонецФункции

&НаСервере
Процедура ВывестиПротоколЗагрузки(ОбработкаОбмена,Протокол) Экспорт
	Если Протокол.Ошибки.Количество()=0 Тогда
		Сообщить("Загруженные объекты: ");
		Для Каждого Элемент Из ОбработкаОбмена.ОбъектыОбмена Цикл
			ОбъектСсылка=Неопределено;
			Если СтрНайти(Элемент.ОбъектТип,"РегистрСведений.")=0 Тогда			
				Менеджер 	= ОбработкаОбмена.ПолучитьМенеджерКласса(Элемент.ОбъектТип);
				Если Менеджер<>Неопределено Тогда				
					ОбъектСсылка= Менеджер.ПолучитьСсылку(Элемент.ОбъектСсылкаУИД);
				КонецЕсли;				
			КонецЕсли;			
			
			Если СтрНайти(Элемент.ОбъектТип,"РегистрСведений.")=1 Тогда
				Сообщить("	"+Элемент.ОбъектТип+", записей: "+Элемент.КоличествоЗаписей+" "+Элемент.ВариантВыгрузки);	
			Иначе
				Сообщить("	"+Элемент.ОбъектТип+" "+ОбъектСсылка+" ("+Элемент.ОбъектСсылкаУИД+")"+Элемент.ВариантВыгрузки);	
			КонецЕсли; 			
		КонецЦикла;
	Иначе
		ТекстОшибки=СтрСоединить(Протокол.Ошибки,Символы.ПС);
		Сообщить(ТекстОшибки,СтатусСообщения.Важное);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайла_ОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ФР_РаботаСДиалогами.ЧудесатыйВыборФайла(ЭтаФорма, Элемент, "xml", "Файл xml (*.xml)|*.xml", РежимДиалогаВыбораФайла.Открытие);
КонецПроцедуры
